load the data

# this is 3.1

In [2]:
import pandas as pd
df = pd.read_csv("data_science_employees.csv")
df.head()

,emp_id,name,department,salary,join_date,location,performance_score
0,1,Sita,IT,NaN,2020-07-17,Lalitpur,2.0
1,2,John,IT,NaN,2023-02-25,Kathmandu,5.0
2,3,Anita,IT,45000.0,2019-07-11,Lalitpur,2.0
3,4,Sneha,Operations,45000.0,2022-02-23,Lalitpur,NaN
4,5,Sneha,Marketing,50000.0,2021-07-08,Bhaktapur,1.0

In [3]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   emp_id             100 non-null    int64
 1   name               100 non-null    object
 2   department         100 non-null    object
 3   salary             85 non-null     float64
 4   join_date          100 non-null    object
 5   location           100 non-null    object
 6   performance_score  79 non-null     float64
dtypes: float64(2), int64(1), object(4)
memory usage: 5.6+ KB

,emp_id,name,department,salary,join_date,location,performance_score
count,100.000000,100,100,85.000000,100,100,79.000000
unique,NaN,10,5,NaN,96,4,NaN
top,NaN,Priya,Operations,NaN,2021-02-27,Lalitpur,NaN
freq,NaN,15,25,NaN,2,30,NaN
mean,50.500000,NaN,NaN,53705.882353,NaN,NaN,2.962025
std,29.011492,NaN,NaN,6950.203028,NaN,NaN,1.522843
min,1.000000,NaN,NaN,45000.000000,NaN,NaN,1.000000
25%,25.750000,NaN,NaN,50000.000000,NaN,NaN,2.000000
50%,50.500000,NaN,NaN,55000.000000,NaN,NaN,3.000000
75%,75.250000,NaN,NaN,60000.000000,NaN,NaN,4.500000
max,100.000000,NaN,NaN,65000.000000,NaN,NaN,5.000000

In [4]:
departments = pd.DataFrame({
    "department": ["IT", "HR", "Finance", "Marketing", "Operations"],
    "dept_head": ["Ramesh", "Sita", "John", "Priya", "Anita"]
})
departments

   department dept_head
0          IT    Ramesh
1          HR      Sita
2     Finance      John
3   Marketing     Priya
4  Operations     Anita

In [5]:
df_merged = pd.merge(df , departments , on="department" , how="left")
df_merged.head()

,emp_id,name,department,salary,join_date,location,performance_score,dept_head
0,1,Sita,IT,NaN,2020-07-17,Lalitpur,2.0,Ramesh
1,2,John,IT,NaN,2023-02-25,Kathmandu,5.0,Ramesh
2,3,Anita,IT,45000.0,2019-07-11,Lalitpur,2.0,Ramesh
3,4,Sneha,Operations,45000.0,2022-02-23,Lalitpur,NaN,Anita
4,5,Sneha,Marketing,50000.0,2021-07-08,Bhaktapur,1.0,Priya

In [8]:
# joining dataframe

In [10]:
# Reset index for clarity
df_indexed = df.set_index("department")
departments_indexed = departments.set_index("department")

df_joined = df_indexed.join(departments_indexed, how="left")
df_joined.head()

,emp_id,name,salary,join_date,location,performance_score,dept_head
department,,,,,,,
IT,1,Sita,NaN,2020-07-17,Lalitpur,2.0,Ramesh
IT,2,John,NaN,2023-02-25,Kathmandu,5.0,Ramesh
IT,3,Anita,45000.0,2019-07-11,Lalitpur,2.0,Ramesh
Operations,4,Sneha,45000.0,2022-02-23,Lalitpur,NaN,Anita
Marketing,5,Sneha,50000.0,2021-07-08,Bhaktapur,1.0,Priya

In [11]:
df_melted = pd.melt(df,
                    id_vars=["emp_id","name"],
                    value_vars=["salary","performance_score"],
                    var_name="metric",
                    value_name="value")
df_melted.head()

   emp_id   name  metric    value
0       1   Sita  salary      NaN
1       2   John  salary      NaN
2       3  Anita  salary  45000.0
3       4  Sneha  salary  45000.0
4       5  Sneha  salary  50000.0

In [13]:
pivot = df.pivot_table(
    index="department",
    values="salary",
    aggfunc="mean",
    fill_value=0
)
pivot

                  salary
department
Finance     54000.000000
HR          53928.571429
IT          51764.705882
Marketing   53125.000000
Operations  55217.391304

In [14]:
melted = pd.melt(
    df,
    id_vars=["name"],
    value_vars=["salary","performance_score"]
)

melted.head()

    name variable    value
0   Sita   salary      NaN
1   John   salary      NaN
2  Anita   salary  45000.0
3  Sneha   salary  45000.0
4  Sneha   salary  50000.0

In [16]:
pivot = df.pivot_table(
    index="department",
    values="salary",
    aggfunc="mean"
)

pivot

pivot2 = df.pivot_table(
    index="department",
    columns="location",
    values="salary",
    aggfunc="mean"
)

pivot2

location    Bhaktapur     Kathmandu  Lalitpur       Pokhara
department
Finance       51250.0  53333.333333   57500.0  55000.000000
HR            52500.0  50000.000000   52500.0  57000.000000
IT            45000.0  49285.714286   53125.0  65000.000000
Marketing     48750.0  55000.000000   55000.0  52500.000000
Operations    57000.0  56428.571429   53750.0  53571.428571

In [17]:
df.isnull().sum()

emp_id                0
name                  0
department            0
salary               15
join_date             0
location              0
performance_score    21
dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   emp_id             100 non-null    int64
 1   name               100 non-null    object
 2   department         100 non-null    object
 3   salary             85 non-null     float64
 4   join_date          100 non-null    object
 5   location           100 non-null    object
 6   performance_score  79 non-null     float64
dtypes: float64(2), int64(1), object(4)
memory usage: 5.6+ KB

In [19]:
df.dropna()

,emp_id,name,department,salary,join_date,location,performance_score
2,3,Anita,IT,45000.0,2019-07-11,Lalitpur,2.0
4,5,Sneha,Marketing,50000.0,2021-07-08,Bhaktapur,1.0
5,6,John,Marketing,55000.0,2020-07-23,Lalitpur,2.0
6,7,Kiran,IT,45000.0,2021-02-17,Kathmandu,3.0
8,9,Ravi,Operations,45000.0,2024-06-15,Pokhara,1.0
...,...,...,...,...,...,...,...
93,94,Anita,Operations,50000.0,2023-01-11,Pokhara,4.0
94,95,Anita,HR,50000.0,2022-09-05,Kathmandu,1.0
95,96,Anita,HR,50000.0,2023-07-05,Pokhara,1.0
96,97,Sneha,HR,45000.0,2021-07-23,Lalitpur,4.0
97,98,Sneha,Operations,65000.0,2020-10-11,Pokhara,5.0

In [20]:
df.dropna(subset=["salary"])

,emp_id,name,department,salary,join_date,location,performance_score
2,3,Anita,IT,45000.0,2019-07-11,Lalitpur,2.0
3,4,Sneha,Operations,45000.0,2022-02-23,Lalitpur,NaN
4,5,Sneha,Marketing,50000.0,2021-07-08,Bhaktapur,1.0
5,6,John,Marketing,55000.0,2020-07-23,Lalitpur,2.0
6,7,Kiran,IT,45000.0,2021-02-17,Kathmandu,3.0
...,...,...,...,...,...,...,...
95,96,Anita,HR,50000.0,2023-07-05,Pokhara,1.0
96,97,Sneha,HR,45000.0,2021-07-23,Lalitpur,4.0
97,98,Sneha,Operations,65000.0,2020-10-11,Pokhara,5.0
98,99,Sneha,Marketing,65000.0,2021-07-02,Lalitpur,NaN
99,100,Ravi,Marketing,55000.0,2023-03-20,Lalitpur,NaN

In [21]:
df["salary"].fillna(df["salary"].mean(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_11380\3472753723.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(),inplace=True)

In [22]:
df["performance_score"].fillna(
    df["performance_score"].mode()[0],
    inplace=True
)

C:\Users\HP\AppData\Local\Temp\ipykernel_11380\409783057.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["performance_score"].fillna(

In [23]:
df["department"]=df["department"].astype("category").cat.codes

In [28]:
import numpy as np
import pandas as pd

# Sample data
data = pd.DataFrame({
    "Salary": [20000, 40000, 100000, 500000, 1000000]
})

data

    Salary
0    20000
1    40000
2   100000
3   500000
4  1000000

In [29]:
data["Log_Salary"] = np.log(data["Salary"])

data

    Salary  Log_Salary
0    20000    9.903488
1    40000   10.596635
2   100000   11.512925
3   500000   13.122363
4  1000000   13.815511

In [30]:
from sklearn.preprocessing import MinMaxScaler

# Sample dataset
data = pd.DataFrame({
    "Age": [18, 25, 35, 45, 60],
    "Salary": [20000, 30000, 60000, 90000, 150000]
})

data

   Age  Salary
0   18   20000
1   25   30000
2   35   60000
3   45   90000
4   60  150000

In [32]:
scaler = MinMaxScaler()

scaled_data = scaler.fit_transform(data)

scaled_df = pd.DataFrame(scaled_data, columns=data.columns)

scaled_df

        Age    Salary
0  0.000000  0.000000
1  0.166667  0.076923
2  0.404762  0.307692
3  0.642857  0.538462
4  1.000000  1.000000

In [33]:
# Sample data
data = pd.DataFrame({
    "City": ["Kathmandu", "Pokhara", "Lalitpur", "Kathmandu"]
})

data

        City
0  Kathmandu
1    Pokhara
2   Lalitpur
3  Kathmandu

In [35]:
encoded_data = pd.get_dummies(data, columns=["City"])

encoded_data

   City_Kathmandu  City_Lalitpur  City_Pokhara
0            True          False         False
1           False          False          True
2           False           True         False
3            True          False         False

In [36]:
data = pd.DataFrame({
    "Age": [22, 35, 50],
    "Salary": [20000, 60000, 120000],
    "City": ["Kathmandu", "Pokhara", "Lalitpur"]
})

data

   Age  Salary       City
0   22   20000  Kathmandu
1   35   60000    Pokhara
2   50  120000   Lalitpur

In [38]:
data["Salary"] = np.log(data["Salary"])
data

   Age    Salary       City
0   22  2.292887  Kathmandu
1   35  2.398086    Pokhara
2   50  2.459183   Lalitpur

In [40]:
scaler = MinMaxScaler()
data[["Age", "Salary"]] = scaler.fit_transform(data[["Age", "Salary"]])
data

        Age    Salary       City
0  0.000000  0.000000  Kathmandu
1  0.464286  0.632604    Pokhara
2  1.000000  1.000000   Lalitpur

In [43]:
data = pd.get_dummies(data, columns=["City"])

KeyError: "None of [Index(['City'], dtype='object')] are in the [columns]"

In [44]:
data

        Age    Salary  City_Kathmandu  City_Lalitpur  City_Pokhara
0  0.000000  0.000000            True          False         False
1  0.464286  0.632604           False          False          True
2  1.000000  1.000000           False           True         False

In [48]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    "Age": np.random.randint(18, 60, 100000),
    "Salary": np.random.randint(20000, 1000000, 100000),
    "City": np.random.choice(["Kathmandu", "Pokhara", "Lalitpur"], 100000)
})

data.head()

   Age  Salary       City
0   23  697112   Lalitpur
1   35  343738  Kathmandu
2   34  604932    Pokhara
3   50  833305   Lalitpur
4   30  108076    Pokhara

In [49]:
data.memory_usage(deep=True)

Index         132
Age        400000
Salary     400000
City      5700029
dtype: int64

In [50]:
data.memory_usage(deep=True).sum()/1024**2

6.199036598205566

In [51]:
data.dtypes

Age        int32
Salary     int32
City      object
dtype: object

In [53]:
data["Age"] = data["Age"].astype("int8")
data["Salary"] = data["Salary"].astype("int32")

In [54]:
data["City"] = data["City"].astype("category")

In [55]:
data.memory_usage(deep=True).sum() / 1024**2

0.572596549987793

In [56]:
result = []
for salary in data["Salary"]:
    result.append(salary * 0.10)

In [57]:
result = data["Salary"] * 0.10

In [58]:
data["Tax"] = data["Salary"] * 0.1

In [61]:
chunks = data

total_salary = 0

for chunk in chunks:
    total_salary += chunk["Salary"].sum()

total_salary

TypeError: string indices must be integers, not 'str'

In [62]:
def clean_data(df):
    df = df.dropna()
    df["Age"] = (df["Age"] - df["Age"].min()) / (df["Age"].max() - df["Age"].min())
    return df